import telebot
from telebot import types

TOKEN = "8446961711:AAGIJ1O4yc9G2UMzK_oNe9dceXPbDMPvsyU"
ADMIN_ID = 6106332911
bot = telebot.TeleBot(TOKEN)

# ======= کیبورد اصلی زیر باکس پیام =======
def main_keyboard():
    kb = types.ReplyKeyboardMarkup(row_width=2, resize_keyboard=True)
    kb.add("🦋 خدمات", "🪼 نمونه‌کارها")
    kb.add("💘 رضایت", "‼️ راهنما و قوانین")
    kb.add("📢 پشتیبانی و مشاوره قبل از خرید")
    return kb

# ======= دکمه های شیشه ای خدمات =======
def services_inline():
    kb = types.InlineKeyboardMarkup(row_width=2)

    kb.add(
        types.InlineKeyboardButton("طراحی رابط کاربری وبسایت", callback_data="ui"),
        types.InlineKeyboardButton("طراحی لوگو", callback_data="logo")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی کارت ویزیت", callback_data="card"),
        types.InlineKeyboardButton("طراحی سربرگ", callback_data="letterhead")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی بروشور", callback_data="brochure"),
        types.InlineKeyboardButton("طراحی پوستر", callback_data="poster")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی تراکت", callback_data="flyer"),
        types.InlineKeyboardButton("طراحی ست اداری", callback_data="setedari")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی منوی رستوران", callback_data="menu"),
        types.InlineKeyboardButton("طراحی کاراکتر دوبعدی", callback_data="character")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی کاور موزیک", callback_data="music"),
        types.InlineKeyboardButton("طراحی کاور کتاب", callback_data="book")
    )

    kb.add(
        types.InlineKeyboardButton("طراحی پست اینستاگرام", callback_data="insta"),
        types.InlineKeyboardButton("پیاده سازی روی موکاپ", callback_data="mockup")
    )

    kb.add(
        types.InlineKeyboardButton("بازگشت", callback_data="back_to_main")
    )

    return kb

# ======= تابع نمایش خدمات (برای دکمه و کامند) =======
def show_services(chat_id):
    bot.send_message(chat_id, """🩷 لطفا خدمات مورد نظر خود را انتخاب کنید:

🖊 استفاده از این ربات به منزله قبول تمامی قوانین ربات هست.
⚜ قوانین: /rules:""", reply_markup=services_inline())


# ======= دستور /start =======
@bot.message_handler(commands=['start'])
def start_msg(message):
    bot.send_message(message.chat.id,
"""به دنیای خدمات گرافیکی آکاردو خوش اومدی💭🪷

🪽طراحی سفارشی و متناسب با نیازهای شما 
🪽استفاده از رنگها و اشکال منحصر به فرد
🪽تحویل به موقع و با کیفیت بالا
🪽مشاوره رایگان برای انتخاب بهترین طرح

✨ همین الان سفارشت رو ثبت کن و اولین قدم برای موفقیت برندت رو بردار!

🐚 انجام تمام خدمات گرافیکی 🎳""",
                     reply_markup=main_keyboard())

# ======= کامندها =======

@bot.message_handler(commands=['services'])
def services_command(message):
    show_services(message.chat.id)


@bot.message_handler(commands=['portfolio'])
def portfolio_command(message):
    bot.send_message(message.chat.id,
"""برای مشاهده نمونه‌کارهای انجام‌شده و آشنایی با سبک طراحی‌ها،
از طریق لینک زیر وارد گالری بشید و با خیال راحت انتخاب کنید 👇
https://drive.google.com/drive/folders/1WzcLP2w5f3K81XixyRI_OLZYr2gS6d6w?usp=drive_link
""",
                     reply_markup=main_keyboard())


@bot.message_handler(commands=['rules'])
def rules_command(message):
    bot.send_message(message.chat.id,
"""📜 قوانین ثبت سفارش

 لطفاً قبل از ثبت سفارش، توضیحات کامل و دقیق پروژه را ارسال کنید.
 پس از نهایی شدن جزئیات، زمان تحویل اعلام می‌شود و رعایت خواهد شد.
 شروع طراحی پس از تأیید سفارش انجام می‌شود.
 امکان ویرایش جزئی وجود دارد، اما تغییرات کلی شامل هزینه جداگانه خواهد بود.
 پس از تحویل نهایی و تأیید مشتری، پروژه بسته خواهد شد.
 ارسال فایل نهایی پس از تسویه انجام می‌شود.
 احترام متقابل در طول همکاری الزامی است 🤍

✨ ثبت سفارش به منزله مطالعه و پذیرش قوانین است.""",
                     reply_markup=main_keyboard())


@bot.message_handler(commands=['support'])
def support_command(message):
    bot.send_message(message.chat.id,
"""📞 پشتیبانی و مشاوره قبل از ثبت سفارش

اگر برای انتخاب نوع طراحی یا جزئیات پروژه‌تون سوالی دارید،
قبل از ثبت سفارش می‌تونید مشاوره رایگان دریافت کنید.

برای ارتباط مستقیم از طریق آیدی زیر پیام بدید 👇
@tsxczi""",
                     reply_markup=main_keyboard())
    
# ======= دریافت توضیحات سفارش =======
@bot.message_handler(func=lambda m: m.chat.id in user_orders, content_types=['text','photo','document','voice'])
def handle_order_text(message):
    chat_id = message.chat.id

    # مطمئن میشیم سرویس انتخابی هنوز موجوده
    service_name = user_orders.get(chat_id)
    if not service_name:
        return  # اگر سرویس نبود، چیزی انجام نده

    # حذف بعد از گرفتن سرویس
    user_orders.pop(chat_id)

    # پیام تایید به کاربر
    bot.send_message(chat_id,
                     "✅ سفارش شما ثبت شد و به زودی بررسی می‌شود.",
                     reply_markup=main_keyboard())

    # متن پایه برای ادمین
    admin_text = (
        f"📥 سفارش جدید دریافت شد!\n\n"
        f"👤 آیدی کاربر: @{message.from_user.username}\n"
        f"🆔 آی‌دی عددی: {chat_id}\n"
        f"🛠 سرویس انتخابی: {service_name}\n\n"
    )

    # ارسال به ادمین بر اساس نوع پیام
    if message.content_type == 'text':
        bot.send_message(ADMIN_ID, admin_text + f"📝 متن سفارش:\n{message.text}")

    elif message.content_type == 'photo':
        bot.send_message(ADMIN_ID, admin_text + "📷 عکس ارسال شد")
        bot.send_photo(ADMIN_ID, message.photo[-1].file_id, caption=message.caption or "")

    elif message.content_type == 'document':
        bot.send_message(ADMIN_ID, admin_text + f"📄 فایل ارسال شد: {message.document.file_name}")
        bot.send_document(ADMIN_ID, message.document.file_id, caption=message.caption or "")

    elif message.content_type == 'voice':
        bot.send_message(ADMIN_ID, admin_text + "🎙 ویس ارسال شد")
        bot.send_voice(ADMIN_ID, message.voice.file_id, caption=message.caption or "")
    
# ======= هندل پیام های اصلی (ReplyKeyboard) =======
@bot.message_handler(func=lambda m: True)
def handle_main(message):
    chat_id = message.chat.id
    text = message.text

    if text == "🦋 خدمات":
        show_services(chat_id)

    elif text == "🪼 نمونه‌کارها":
        bot.send_message(chat_id, """برای مشاهده نمونه‌کارهای انجام‌شده و آشنایی با سبک طراحی‌ها،
از طریق لینک زیر وارد گالری بشید و با خیال راحت انتخاب کنید 👇
https://drive.google.com/drive/folders/1WzcLP2w5f3K81XixyRI_OLZYr2gS6d6w?usp=drive_link
""",
                         reply_markup=main_keyboard())

    elif text == "💘 رضایت":
        bot.send_message(chat_id, """⭐ اعتماد ساخته نمی‌شود، اثبات می‌شود.

بازخورد مشتری‌های ما، گواه کیفیت، دقت و تعهد در هر پروژه است.

برای مشاهده رضایت‌ها و نظرات ثبت‌شده، از طریق لینک زیر اقدام کنید 👇
@Accardo_Satisfaction
""",
                         reply_markup=main_keyboard())

    elif text == "‼️ راهنما و قوانین":
        bot.send_message(chat_id, """📜 قوانین ثبت سفارش

 لطفاً قبل از ثبت سفارش، توضیحات کامل و دقیق پروژه را ارسال کنید.
 پس از نهایی شدن جزئیات، زمان تحویل اعلام می‌شود و رعایت خواهد شد.
 شروع طراحی پس از تأیید سفارش انجام می‌شود.
 امکان ویرایش جزئی وجود دارد، اما تغییرات کلی شامل هزینه جداگانه خواهد بود.
 پس از تحویل نهایی و تأیید مشتری، پروژه بسته خواهد شد.
 ارسال فایل نهایی پس از تسویه انجام می‌شود.
 احترام متقابل در طول همکاری الزامی است 🤍

✨ ثبت سفارش به منزله مطالعه و پذیرش قوانین است.""",
                         reply_markup=main_keyboard())

    elif text == "📢 پشتیبانی و مشاوره قبل از خرید":
        bot.send_message(chat_id, """📞 پشتیبانی و مشاوره قبل از ثبت سفارش

اگر برای انتخاب نوع طراحی یا جزئیات پروژه‌تون سوالی دارید،
قبل از ثبت سفارش می‌تونید مشاوره رایگان دریافت کنید.

برای ارتباط مستقیم از طریق آیدی زیر پیام بدید 👇
@tsxczi""",
                         reply_markup=main_keyboard())
# ======= توضیحات کامل خدمات =======
services_info = {
    "ui": "طراحی رابط کاربری سایت، مدرن و حرفه‌ای.\n\n"
          "⏱ زمان انجام: 1 تا 3 هفته\n"
          "✏️ تعداد ویرایش رایگان: 2 بار\n"
          "💰 هزینه تقریبی: 3 میلیون تومان\n\n"
          "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "logo": "لوگوی اختصاصی و ماندگار که برند شما رو منحصر به فرد می کند.\n\n"
            "⏱ زمان انجام: 3 تا 5 روز کاری\n"
            "✏️ تعداد ویرایش رایگان: 3 بار\n"
            "💰 هزینه تقریبی: 600 هزار تومان\n\n"
            "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "card": "طراحی کارت ویزیت حرفه‌ای و جذاب برای برند شما.\n\n"
            "⏱ زمان انجام: 2 تا 4 روز کاری\n"
            "✏️ تعداد ویرایش رایگان: 2 بار\n"
            "💰 هزینه تقریبی: 400 هزار تومان\n\n"
            "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "letterhead": "طراحی سربرگ اختصاصی با هویت برند شما.\n\n"
                  "⏱ زمان انجام: 2 تا 3 روز کاری\n"
                  "✏️ تعداد ویرایش رایگان: 2 بار\n"
                  "💰 هزینه تقریبی: 300 هزار تومان\n\n"
                  "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "brochure": "طراحی بروشور حرفه‌ای و جذاب برای معرفی خدمات و محصولات شما.\n\n"
                "⏱ زمان انجام: 4 تا 6 روز کاری\n"
                "✏️ تعداد ویرایش رایگان: 3 بار\n"
                "💰 هزینه تقریبی: 800 هزار تومان\n\n"
                "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "poster": "طراحی پوستر تبلیغاتی و گرافیکی جذاب.\n\n"
              "⏱ زمان انجام: نهایت یک هفته\n"
              "✏️ تعداد ویرایش رایگان: 2 بار\n"
              "💰 هزینه تقریبی: 800 هزار تومان\n\n"
              "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "flyer": "طراحی تراکت حرفه‌ای و خلاقانه برای تبلیغات.\n\n"
             "⏱ زمان انجام: 1 تا 3 روز کاری\n"
             "✏️ تعداد ویرایش رایگان: 2 بار\n"
             "💰 هزینه تقریبی: 200 هزار تومان\n\n"
             "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "setedari": "طراحی ست اداری کامل برای هویت برند شما.\n\n"
                "⏱ زمان انجام: 1 هفته\n"
                "✏️ تعداد ویرایش رایگان: 2 بار\n"
                "💰 هزینه تقریبی: 1 میلیون تومان\n\n"
                "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "menu": "طراحی منوی رستوران با ظاهر جذاب و خوانا.\n\n"
            "⏱ زمان انجام: 2 تا 3 روز کاری\n"
            "✏️ تعداد ویرایش رایگان: 2 بار\n"
            "💰 هزینه تقریبی: 400 هزار تومان\n\n"
            "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "character": "طراحی کاراکتر دوبعدی و منحصر به فرد.\n\n"
                 "⏱ زمان انجام: 5 تا 7 روز کاری\n"
                 "✏️ تعداد ویرایش رایگان: 2 بار\n"
                 "💰 هزینه تقریبی: 900 هزار تومان\n\n"
                 "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "music": "طراحی کاور موزیک حرفه‌ای و خلاقانه.\n\n"
             "⏱ زمان انجام: 2 تا 4 روز کاری\n"
             "✏️ تعداد ویرایش رایگان: 2 بار\n"
             "💰 هزینه تقریبی: 150 هزار تومان\n\n"
             "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "book": "طراحی کاور کتاب اختصاصی و جذاب.\n\n"
            "⏱ زمان انجام: 3 تا 5 روز کاری\n"
            "✏️ تعداد ویرایش رایگان: 3 بار\n"
            "💰 هزینه تقریبی: 150 هزار تومان\n\n"
            "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "insta": "طراحی پست اینستاگرام خلاقانه و جذاب برای برند شما.\n\n"
             "⏱ زمان انجام: 1 تا 2 روز کاری\n"
             "✏️ تعداد ویرایش رایگان: 2 بار\n"
             "💰 هزینه تقریبی: 200 هزار تومان\n\n"
             "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد.",

    "mockup": "پیاده ه‌سازی طرح‌ها روی موکاپ واقعی.\n\n"
              "⏱ زمان انجام: 1 تا 2 روز کاری\n"
              "✏️ تعداد ویرایش رایگان: 10 بار\n"
              "💰 هزینه تقریبی: 50 هزار تومان\n\n"
              "مدت زمان و هزینه پروژه بسته به پیچیدگی طرح شما ممکن است متفاوت باشد."
}

# ======= هندلر دکمه های شیشه ای خدمات =======
user_orders = {}  # برای ذخیره موقت سفارشات

@bot.callback_query_handler(func=lambda call: True)
def handle_services(call):
    chat_id = call.message.chat.id

    # وقتی یکی از خدمات انتخاب شد
    if call.data in services_info:
        text = services_info[call.data]  # متن کامل از دیکشنری
        # دکمه سفارش و بازگشت
        kb = types.InlineKeyboardMarkup()
        kb.add(
            types.InlineKeyboardButton("سفارش", callback_data=f"order_{call.data}"),
            types.InlineKeyboardButton("بازگشت", callback_data="back_to_services")
        )
        bot.edit_message_text(chat_id=chat_id, message_id=call.message.message_id,
                              text=text, reply_markup=kb)

    # وقتی روی سفارش کلیک شد
    elif call.data.startswith("order_"):
        service_name = call.data.split("_")[1]
        user_orders[chat_id] = service_name
        bot.send_message(chat_id, f"کاربر محترم، لطفاً توضیحات سفارش را بنویسید و در پایان پیام حتما شماره تماس خودتان را قرار دهید. امکان ارسال تصویر ویس و فایل هست اما هنگام ارسال حتما در کپشن فایل، توضیحات سفارش را درج کنید.")

    # بازگشت به صفحه خدمات
    elif call.data == "back_to_services":
        bot.edit_message_text(chat_id=chat_id, message_id=call.message.message_id,
                              text="""🩷 لطفا خدمات مورد نظر خود را انتخاب کنید:

🖊 استفاده از این ربات به منزله قبول تمامی قوانین ربات هست.
⚜ قوانین: /rules:""", reply_markup=services_inline())

    # بازگشت به کیبورد اصلی
    elif call.data == "back_to_main":
        bot.edit_message_text(chat_id=chat_id, message_id=call.message.message_id,
                              text="یکی از گزینه‌های زیر را انتخاب کنید:", reply_markup=main_keyboard())




# ======= شروع ربات =======
while True:
    try:
        bot.polling(none_stop=True)
    except Exception as e:
        print("Error:", e)

